<?php
//印地语
return [
    // +----------------------------------------------------------------------
    // | 系统级日志
    // +----------------------------------------------------------------------
    'system_success' => 'सफलता से संचालन किया गया',
    'system_failed' => 'संचालन विफल',
    'system_error' => 'सिस्टम त्रुटि',

    // +----------------------------------------------------------------------
    // | 验证器 Validate
    // +----------------------------------------------------------------------
    // 登录注册模块
    'account.require' => 'खाता आवश्यक है',
    'account.regex' => 'खाता संख्या अल्फान्यूमेरिक होनी चाहिए',
    'account.length' => 'खाता संख्या 6 से 12 अंकों के बीच होनी चाहिए',
    'account.unique' => 'खाता पहले से मौजूद है',
    'full_name.require' => 'पूरा नाम आवश्यक है',
    'password.require' => 'पासवर्ड आवश्यक है',
    'password.length' => 'पासवर्ड 6-25 वर्णों के बीच होना चाहिए',
    'password.regex' => 'पासवर्ड में संख्या, अक्षर या प्रतीक का संयोजन होना चाहिए',
    'password_confirm.require' => 'पासवर्ड पुष्टि आवश्यक है',
    'password_confirm.confirm' => 'दोनों पासवर्ड भिन्न हैं',
    'phone_number.require' => 'फोन नंबर आवश्यक है',
    'email.require' => 'ईमेल आवश्यक है',
    'code.require' => 'कोड आवश्यक है',
    'invitation_code.require' => 'आमंत्रण कोड आवश्यक है',
    'invitation_code.unique' => 'आमंत्रण कोड पहले से मौजूद है',
    'invitation_code_failed' => 'आमंत्रण कोड जनरेट करना विफल रहा। कृपया बाद में पुनः प्रयास करें',
    'account_disabled' => 'खाता हटाया गया है या निष्क्रिय कर दिया गया है',
    'token_missing' => 'अनुरोध पैरामीटर में टोकन की कमी है',
    'login_again' => 'लॉगिन का समय समाप्त हो गया, कृपया पुनः लॉगिन करें',
    // 修改密码
    'old_password.require' => 'पुराना पासवर्ड आवश्यक है',
    'new_password.require' => 'नया पासवर्ड आवश्यक है',
    'new_password.length' => 'पासवर्ड 6-25 वर्णों के बीच होना चाहिए',
    'new_password.alphaNum' => 'पासवर्ड अल्फान्यूमेरिक होना चाहिए',

    // +----------------------------------------------------------------------
    // | 业务逻辑 Controller Logic
    // +----------------------------------------------------------------------
    // 登录注册
    'register_success' => 'सफलतापूर्वक पंजीकृत किया गया',
    'send_code_success' => 'सत्यापन कोड सफलतापूर्वक भेजा गया',
    'send_code_failed' => 'सत्यापन कोड भेजना विफल रहा',
    'code_empty' => 'आपने ईमेल सत्यापन कोड नहीं भेजा है',
    'code_expired' => 'आपका सत्यापन कोड समाप्त हो गया है, कृपया पुनः भेजें',
    'code_invalidate' => 'सत्यापन कोड गलत है',
    'user_not_exist' => 'उपयोगकर्ता मौजूद नहीं है',
    'password_invalidate' => 'गलत पासवर्ड',
    'old_password_invalidate' => 'मूल पासवर्ड त्रुटि',
    // 邮箱验证码
    'email_title' => 'ईमेल सत्यापन कोड',
    'email_body' => 'आपका सत्यापन कोड है: <b>%s</b>, प्रभावी समय है: <b>%s</b> मिनट',
    //给邮箱发送6位数密码
    'email_pwd_title' => 'नया लॉगिन पासवर्ड',
    'email_pwd_body' => 'आपका नया लॉगिन पासवर्ड है: <b>%s</b>',
    'update_pwd_success' => 'पासवर्ड परिवर्तन सफल! कृपया अपना नया पासवर्ड प्राप्त करने के लिए अपने ईमेल पर जाएं और पुनः लॉगिन करें',
    'update_pwd_failed' => 'पासवर्ड परिवर्तन विफल! कृपया पुनः प्रयास करें।',
    // 分享海报
    'has_shared' => 'आपने आज साझा किया है, कृपया कल फिर आएं',

    //下单
    'product_cannot_empty' => 'उत्पाद खाली नहीं हो सकता',
    'voucher_cannot_empty' => 'भुगतान वाउचर खाली नहीं हो सकता',
    'hash_empty' => 'हैश पता खाली नहीं हो सकता',
    'product_taken_down' => 'उत्पाद हटा दिया गया है, कृपया पुनः प्रयास करें',
    'order_succees' => 'ऑर्डर सफलतापूर्वक दिया गया, कृपया समीक्षा के लिए प्रतीक्षा करें',
    'order_fail' => 'ऑर्डर विफल रहा, कृपया पुनः प्रयास करें',
    'order_pending' => 'आपके पास अभी भी समीक्षा के लिए लंबित ऑर्डर हैं',
    'order_hash_already' => 'हैश पता पहले से मौजूद है',
    'invitation_code_error' => 'आमंत्रण कोड मौजूद नहीं है',
    'email_already_exist' => 'ईमेल पहले से मौजूद है',
    'account_already_exist' => 'खाता पहले से मौजूद है',
    'mobile_already_exist' => 'मोबाइल पहले से मौजूद है',
    'email_not_exist' => 'ईमेल मौजूद नहीं है',
    'username_not_exist' => 'उपयोगकर्ता नाम मौजूद नहीं है',
    'email_is_empty' => 'ईमेल खाली नहीं हो सकता',
    'username_is_empty' => 'उपयोगकर्ता नाम खाली नहीं हो सकता',
];
